> > the content is dynamically changing for each refresh so I see no need to calculate source_md5hash, without it it wont generate any error
> 
> Without providing `source_md5hash` it does not fail, but GCS object is not updated as expected. On the 2nd and following applies, without `source_md5hash` you get:
> 
> ```
>   # local_file.test must be replaced
> -/+ resource "local_file" "test" {
>       ~ content              = jsonencode(
>           ~ {
>               ~ Date                      = "Wed, 29 Jan 2025 16:28:49 GMT" -> "Wed, 29 Jan 2025 16:28:57 GMT"
>                 # (6 unchanged attributes hidden)
>             } # forces replacement
>         )
>       ~ content_base64sha256 = "XAi72B+tStlvTwegiiqMacaxDMJ5YWXxmhTV0UkR/WQ=" -> (known after apply)
>       ~ content_base64sha512 = "HLcO651E5dypjjoqukYQULJDUIBAu0yXvOfBho+mJUXdtBQeHMJLAiOls6NOBOLz2QuVOr5QylRSkd668X3i3w==" -> (known after apply)
>       ~ content_md5          = "2f36e873526b39d9f283c914c5481a55" -> (known after apply)
>       ~ content_sha1         = "950bd65e563da6c132eebde20e3e159687adaa9d" -> (known after apply)
>       ~ content_sha256       = "5c08bbd81fad4ad96f4f07a08a2a8c69c6b10cc2796165f19a14d5d14911fd64" -> (known after apply)
>       ~ content_sha512       = "1cb70eeb9d44e5dca98e3a2aba461050b243508040bb4c97bce7c1868fa62545ddb4141e1cc24b0223a5b3a34e04e2f3d90b953abe50ca545291debaf17de2df" -> (known after apply)
>       ~ id                   = "950bd65e563da6c132eebde20e3e159687adaa9d" -> (known after apply)
>         # (3 unchanged attributes hidden)
>     }
> 
> Plan: 1 to add, 0 to change, 1 to destroy.
> local_file.test: Destroying... [id=950bd65e563da6c132eebde20e3e159687adaa9d]
> local_file.test: Destruction complete after 0s
> local_file.test: Creating...
> local_file.test: Creation complete after 0s [id=5d69ce29f9387701171f493a86bdcc7fcdb00dc9]
> 
> Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
> ```
> 
> So it's only local file that is changing, no change is sent to GCS, which is very bad, as this is silent failure.

could you please check with the latest, this should work and file is uploading to GCS